Tekla.Structures.DialogInternal.dotdiaSettings_t
Dialog setting.

Tekla.Structures.DialogInternal.dotdiaSettings_t.DistanceUnitType
Distance unit type.

Tekla.Structures.DialogInternal.dotdiaSettings_t.AngleUnitType
Angle unit type

Tekla.Structures.DialogInternal.dotdiaSettings_t.Language
Language of the setting.